{
  "episodes": [
    {
      "date": "2026-03-01",
      "summary": "Explore the global shockwaves following the death of Iran’s Supreme Leader and the complex reactions it’s sparking from the Middle East to the streets of Chicago. This episode also analyzes the high-stakes battle over AI ethics in military contracts and breaks down a significant new tipping point for the U.S. housing market.",
      "keyTopics": [
        "Assassination of Iranian Supreme Leader Ayatollah Ali Khamenei",
        "OpenAI and Anthropic dispute over Pentagon military contracts",
        "Judge Jeffrey Cummings orders release of Chicago ICE detainees",
        "The Lancet editorial condemning Robert F. Kennedy Jr.",
        "Redfin report on six percent mortgage rate tipping point",
        "Anthropic Claude chatbot growth following Pentagon risk label",
        "Illinois bill proposal to ban state hiring of ICE agents",
        "San Francisco 49ers Trent Williams contract extension negotiations"
      ]
    },
    {
      "date": "2026-02-28",
      "summary": "This episode explores the global fallout of \"Operation Epic Fury\" following coordinated US and Israeli strikes on Iran that have killed Supreme Leader Khamenei and sent shockwaves through international energy markets. We also analyze the escalating rift in Silicon Valley as OpenAI secures a major military contract rejected by Anthropic, alongside a look at the economic shifts redefining American cities and the housing market.",
      "keyTopics": [
        "Operation Epic Fury US-Israel strikes and Ayatollah Khamenei death",
        "OpenAI Pentagon contract for classified network AI deployment",
        "Pentagon designates Anthropic a supply-chain risk after safety stance",
        "Governor Pritzker and Trump clash over 2026 election integrity",
        "The Lancet editorial criticizing Robert F. Kennedy Jr. leadership",
        "Urban wealth flight and shrinking tax bases in major cities",
        "US mortgage market shift toward rates above six percent"
      ]
    },
    {
      "date": "2026-02-27",
      "summary": "Explore the high-stakes standoff between Anthropic and the Pentagon as AI safety advocates draw a \"red line\" against military demands for unrestricted access to powerful technology. This episode also breaks down Chicago’s mounting financial and operational crises—from a \"debt storm\" hitting residents to the \"ghost services\" straining public trust—while examining the shifting real estate market and a vision for the \"radical upside\" of an AI-driven future.",
      "keyTopics": [
        "Anthropic standoff with Pentagon over military AI access",
        "Jack Dorsey halves Block workforce following Musk efficiency model",
        "Cook County property tax sale delayed until December",
        "Inspector General Deborah Witzburg exposes Chicago 311 ghost services",
        "US homeowners with six percent mortgage rates outnumber three percent",
        "Redfin and Compass partner to pool real estate listings",
        "Golden State Warriors trade Jonathan Kuminga to Atlanta Hawks",
        "Dario Amodei Machines of Loving Grace AI optimism essay"
      ],
      "articles": [
        "Dario Amodei — Machines of Loving Grace"
      ]
    },
    {
      "date": "2026-02-26",
      "summary": "Explore the \"whiplash-inducing\" pace of AI development as industry leaders re-evaluate safety promises and prepare for a future of \"data center geniuses.\" Closer to home, the episode breaks down the local impact of Chicago’s recent credit downgrade and rising financial distress, while offering a glimmer of hope with the lowest mortgage rates in years. Finally, stay up to date with the latest sports highlights, from the Warriors' dominant road win to the latest NFL trade rumors.",
      "keyTopics": [
        "Anthropic safety policy shift and Vercept acquisition",
        "Figma OpenAI Codex and Anthropic AI integrations",
        "Salesforce CEO Marc Benioff SaaSpocalypse defense",
        "Chicago credit rating downgrade and pension crisis",
        "Illinois population battle and Chicago financial distress",
        "Dario Amodei Adolescence of Technology AI essay",
        "San Francisco 49ers Mac Jones trade rumors",
        "US mortgage rates hit 6.01 percent low"
      ],
      "articles": [
        "Dario Amodei — The Adolescence of Technology"
      ]
    },
    {
      "date": "2026-02-25",
      "summary": "Today’s episode explores the evolution of AI into a proactive personal assistant and the growing public backlash against the massive data centers required to power it. We also analyze Chicago’s escalating fiscal challenges and the shifting real estate market where buyers are finally gaining new leverage. From local political updates to high-stakes NFL trade rumors, stay informed on the major headlines shaping technology, economics, and sports.",
      "keyTopics": [
        "Anthropic Vercept acquisition for Claude computer use",
        "Google Gemini multi-step task automation on Android",
        "Growing public opposition to AI data center construction",
        "OpenAI COO considers bringing advertisements to products",
        "Fareed Zakaria Chicago public pension bankruptcy warning",
        "Illinois Senate Bill 2876 school suspension evidence transparency",
        "US home sales record high January cancellation rate",
        "San Francisco 49ers gauging Mac Jones trade value"
      ]
    },
    {
      "date": "2026-02-24",
      "summary": "Today’s episode explores the massive $100 billion investment reshaping the AI arms race and the physical infrastructure bottlenecks threatening to slow it down. We also dive into a shifting housing market where buyers are gaining leverage despite a deepening affordability crisis, and examine critical global tensions between the U.S. and Iran. The show concludes with a look at the future of the blues in Chicago through the eyes of a local legend.",
      "keyTopics": [
        "Meta $100 billion AMD AI chip deal for personal superintelligence",
        "Anthropic industry-specific AI agent plugins and distillation defense",
        "Data center construction delays and AI power grid constraints",
        "US mortgage rate dip and housing affordability crisis",
        "US diplomatic miscalculation of Iran escalation and martyrdom politics",
        "Buddy Guy concerns for the future of Chicago blues"
      ]
    }
  ]
}