{
  "episodes": [
    {
      "date": "2026-02-26",
      "summary": "Explore the \"whiplash-inducing\" pace of AI development as industry leaders re-evaluate safety promises and prepare for a future of \"data center geniuses.\" Closer to home, the episode breaks down the local impact of Chicago’s recent credit downgrade and rising financial distress, while offering a glimmer of hope with the lowest mortgage rates in years. Finally, stay up to date with the latest sports highlights, from the Warriors' dominant road win to the latest NFL trade rumors.",
      "keyTopics": [
        "Anthropic safety policy shift and Vercept acquisition",
        "Figma OpenAI Codex and Anthropic AI integrations",
        "Salesforce CEO Marc Benioff SaaSpocalypse defense",
        "Chicago credit rating downgrade and pension crisis",
        "Illinois population battle and Chicago financial distress",
        "Dario Amodei Adolescence of Technology AI essay",
        "San Francisco 49ers Mac Jones trade rumors",
        "US mortgage rates hit 6.01 percent low"
      ],
      "articles": [
        "Dario Amodei — The Adolescence of Technology"
      ]
    },
    {
      "date": "2026-02-25",
      "summary": "Today’s episode explores the evolution of AI into a proactive personal assistant and the growing public backlash against the massive data centers required to power it. We also analyze Chicago’s escalating fiscal challenges and the shifting real estate market where buyers are finally gaining new leverage. From local political updates to high-stakes NFL trade rumors, stay informed on the major headlines shaping technology, economics, and sports.",
      "keyTopics": [
        "Anthropic Vercept acquisition for Claude computer use",
        "Google Gemini multi-step task automation on Android",
        "Growing public opposition to AI data center construction",
        "OpenAI COO considers bringing advertisements to products",
        "Fareed Zakaria Chicago public pension bankruptcy warning",
        "Illinois Senate Bill 2876 school suspension evidence transparency",
        "US home sales record high January cancellation rate",
        "San Francisco 49ers gauging Mac Jones trade value"
      ]
    },
    {
      "date": "2026-02-24",
      "summary": "Today’s episode explores the massive $100 billion investment reshaping the AI arms race and the physical infrastructure bottlenecks threatening to slow it down. We also dive into a shifting housing market where buyers are gaining leverage despite a deepening affordability crisis, and examine critical global tensions between the U.S. and Iran. The show concludes with a look at the future of the blues in Chicago through the eyes of a local legend.",
      "keyTopics": [
        "Meta $100 billion AMD AI chip deal for personal superintelligence",
        "Anthropic industry-specific AI agent plugins and distillation defense",
        "Data center construction delays and AI power grid constraints",
        "US mortgage rate dip and housing affordability crisis",
        "US diplomatic miscalculation of Iran escalation and martyrdom politics",
        "Buddy Guy concerns for the future of Chicago blues"
      ]
    }
  ]
}