{
  "episodes": [
    {
      "date": "2026-02-25",
      "summary": "This episode explores the high-stakes standoff between the Pentagon and AI developers over safety guardrails, alongside a deep dive into the philosophical debate over whether AI will ultimately save or endanger humanity. It also breaks down shifting leverage in the housing market, key political battles shaping the future of Illinois, and the latest headlines from the world of sports. Dive in for an essential look at the intersection of national security, emerging technology, and local headlines.",
      "keyTopics": [
        "Pentagon deadline for Anthropic to loosen AI safety guardrails",
        "Dario Amodei essays on AI utopian and catastrophic futures",
        "Kim Foxx under scrutiny for Illinois wrongful conviction reviews",
        "Illinois Republican gubernatorial candidates debate Bears stadium funding",
        "Record January home-sale cancellations increase buyer market leverage",
        "San Francisco 49ers trade rumors involving quarterback Mac Jones",
        "AI war game simulations frequently recommending nuclear strikes",
        "Uber engineers develop CEO AI chatbot for pitch practice"
      ],
      "articles": [
        "Dario Amodei — The Adolescence of Technology",
        "Dario Amodei — Machines of Loving Grace"
      ]
    },
    {
      "date": "2026-02-24",
      "summary": "Today’s episode explores the massive $100 billion investment reshaping the AI arms race and the physical infrastructure bottlenecks threatening to slow it down. We also dive into a shifting housing market where buyers are gaining leverage despite a deepening affordability crisis, and examine critical global tensions between the U.S. and Iran. The show concludes with a look at the future of the blues in Chicago through the eyes of a local legend.",
      "keyTopics": [
        "Meta $100 billion AMD AI chip deal for personal superintelligence",
        "Anthropic industry-specific AI agent plugins and distillation defense",
        "Data center construction delays and AI power grid constraints",
        "US mortgage rate dip and housing affordability crisis",
        "US diplomatic miscalculation of Iran escalation and martyrdom politics",
        "Buddy Guy concerns for the future of Chicago blues"
      ]
    }
  ]
}