{
  "episodes": [
    {
      "date": "2026-02-26",
      "summary": "This episode explores the reported chemistry crisis between Lakers superstars LeBron James and Luka Doncic alongside a seismic shift in Anthropic’s approach to AI safety. We also break down the breaking news of an FBI raid on the Los Angeles Schools Chief and provide an update on the glassy, foggy surf conditions greeting the coast today.",
      "keyTopics": [
        "LeBron James and Luka Doncic locker room friction",
        "Tony Bennett hired as Lakers draft adviser",
        "Figma integrates OpenAI Codex and Anthropic Claude Code",
        "Anthropic reported shift away from AI safety guardrails",
        "Marc Benioff addresses Salesforce SaaSpocalypse and AI agents",
        "FBI raid on Los Angeles Schools Chief office"
      ]
    },
    {
      "date": "2026-02-25",
      "summary": "Experience the highs and lows of the sports and tech worlds, from the Lakers' heartbreaking buzzer-beater loss to the rapid integration of AI agents as official team members in the workplace. This episode also dives into major policy moves regarding international data privacy and the latest creative updates from Adobe and Amazon.",
      "keyTopics": [
        "Orlando Magic 110-109 victory over Los Angeles Lakers",
        "Los Angeles Lakers 2026-27 season ticket price hikes",
        "Atlassian Jira AI agents for software engineering tasks",
        "Adobe Firefly video editor Quick Cut feature release",
        "Amazon Alexa+ customizable voice assistant personality options",
        "US government lobbying against foreign data sovereignty laws",
        "Paolo Banchero 36 point game against the Lakers"
      ]
    },
    {
      "date": "2026-02-24",
      "summary": "Dive into a high-stakes standoff between the Pentagon and Anthropic over AI safety guardrails and the latest $500 million investment in the race for chip dominance. This episode also explores the rise of workplace AI agents, regulatory battles facing tech giants, and a key preview of tonight’s Lakers matchup against the Orlando Magic.",
      "keyTopics": [
        "Anthropic and Pentagon dispute over AI safety guardrails",
        "MatX raises 500 million to challenge Nvidia chips",
        "Salesforce rollout of new Slackbot AI agent",
        "Uber engineers build Dara Khosrowshahi CEO chatbot",
        "IRS corporate tax dispute with Meta",
        "OpenAI and Persona identity surveillance machine allegations",
        "Lakers versus Orlando Magic matchup featuring Luka Doncic",
        "Lakers season ticket price hikes for 2026-27"
      ]
    }
  ]
}